# 10은 2의 배수입니다.
# print("%d은 %d의 배수입니다." %(10 , 2))
# a = 10
# b = 2

# 10*2=20
# print("%d * %d = %d" %(a, b, a*b))

## 사용 표시 ##
# %s(문자열) %c(문자1개) %f(실수) %d(정수) %.2f(소수점 2자리 반올림)
# 홍길동 총합 : 299, 평균 : 99.333
# name = "홍길동"
# kor = 100
# eng = 100
# math = 99

# print("%s 총합: %d, 평균: %.2f" %(name, kor+eng+math, (kor+eng+math)/3))

# 출력 자리수 표시
# print("%d" % b)   #2
# print("%5d" % b)  #     2 공간 5자리 확보
# print("%05d" % b) # 00002

# # 001 010 100.00
# num = 1
# num2 = 10
# num3 = 100
# print("-----------")
# print("%03d" %num)
# print("%03d" %num2)
# print("%.2f" %num3)
# print("%03d %03d %.2f" %(num,num2,num3))
# print("%d" % (-10))


# print("-----------")
# print("%.2f" %758.12345678)
# print("%010.2f" % 25.05)
# print("정수: %d 실수: %f 문자열: %s" % (150.15, 150.15, 150.15))
# print("%c" % "*"*10)



### print 사용 형태 ###
# print(a,"은",b,"의 배수입니다.")
# print("%d 은 %d 의 배수입니다." %(a,b))
# print("{} 은 {} 의 배수입니다.".format(a,b))
# print(f"{a}은 {b}의 배수입니다.")
## 숫자를 프린트하는 방법 ##
